import type { Schedule } from "./schedule.types";

export const schedule2025: Schedule = [
  {
    date: "2025-01-29",
    events: [
      {
        date: "2025-01-29",
        startTime: "10:00",
        endTime: "13:00",
        title: "Автобусы",
      },
      {
        date: "2025-01-29",
        startTime: "13:00",
        endTime: "14:00",
        title: "Аксиома выбора и оргвопросы. Первая лекция",
        description:
          "В первой половине лекции обсудим историю возникновения аксиомы выбора, помянем классика и запомним немецко-израильский бренд. Сформулируем эквивалентные аксиоме выбора утверждения и докажем хотя бы одну импликацию. Придём к некоторым противоречиям. Во второй половине лекции договоримся о том, как проведём эту ЗМШ. Откроем.",
        image: "/schedule_2025/2025-01-29/1.jpg",
        speaker: "Вихарев Сергей Викторович",
        speakerCredentials: "Кандидат физ.-мат. наук",
      },
      {
        date: "2025-01-29",
        startTime: "14:00",
        endTime: "17:00",
        title: "Обед",
      },
      {
        date: "2025-01-29",
        startTime: "17:00",
        endTime: "19:00",
        image: "/schedule_2025/2025-01-29/2.jpg",
        description:
          "Один из самых распространённых алгоритмов секретной передачи данных, называемый RSA, содержит в своём ядре очень красивую и нетривиальную, хоть и абсолютно школьную, математику. Я про все тонкости и секреты расскажу на лекции, опуская некоторые детали! По сути, речь идёт о тонких свойствах систем остатков от деления на «полупростые» числа, являющиеся произведением двух простых.",
        title:
          "Формула Эйлера и защищённая передача информации: как работает алгоритм RSA",
        speaker: "Савватеев Алексей Владимирович",
        speakerCredentials:
          "Член-корреспондент РАН по секции «экономика», доктор физ.-мат. наук",
      },
      {
        date: "2025-01-29",
        startTime: "19:00",
        endTime: "20:00",
        title: "Ужин",
      },
      {
        date: "2025-01-29",
        startTime: "20:00",
        endTime: "02:00",
        title: "Знакомство",
      },
      {
        date: "2025-01-30",
        startTime: "02:00",
        endTime: "10:00",
        title: "Отбой",
      },
    ],
  },
  {
    date: "2025-01-30",
    events: [
      {
        date: "2025-01-30",
        startTime: "10:00",
        endTime: "11:00",
        title: "Завтрак",
      },
      {
        date: "2025-01-30",
        startTime: "11:00",
        endTime: "12:30",
        title: "Раскраски гиперграфов и вероятностный метод в комбинаторике",
        speaker: "Райгородский Андрей Михайлович",
        image: "/schedule_2025/2025-01-30/1.webp",
        description:
          "Гиперграф — это важный объект комбинаторики, который обобщает понятие графа. У него тоже есть вершины, но рёбра могут состоять не из двух вершин, а из большего их числа. Например, вершинами могут быть авторы научных статей, а рёбрами — наборы авторов тех или иных конкретных работ. Вершины гиперграфа, как и вершины графа, можно красить. Раскраска называется правильной, если каждое ребро в ней неодноцветно. Мы поговорим об условиях, при которых гиперграфы допускают правильную раскраску в 2 цвета.",
        speakerCredentials:
          "Доктор физ.-мат. наук, профессор, директор Физтех-школы прикладной математики и информатики МФТИ",
      },
      {
        date: "2025-01-30",
        startTime: "12:30",
        endTime: "14:00",
        title: "Факультативная лекция про личную кибербезопасность",
        speaker: "УЦСБ",
      },
      {
        date: "2025-01-30",
        startTime: "14:00",
        endTime: "15:00",
        title: "Обед",
      },
      {
        date: "2025-01-30",
        startTime: "15:00",
        endTime: "17:00",
        title: "Пентестерский мастер-класс по атакам на сети WPA-2 Enterprise",
        speaker: "УЦСБ",
      },
      {
        date: "2025-01-30",
        startTime: "17:00",
        endTime: "17:50",
        title: "Связные подмножества плоскости",
        speaker: "Липин Антон",
        image: "/schedule_2025/2025-01-30/2.jpg",
        description:
          "Что такое связность с точки зрения топологии? Верно ли, что любые две точки связного множества можно соединить кривой, которая содержится в этом множестве? Что такое компоненты связности, и чем они отличаются от квазикомпонент? И сколько точек необходимо удалить из бесконечного связного множества, чтобы остаток рассыпался на одноточечные компоненты?",
        speakerCredentials:
          "Ассистент кафедры математического анализа ИЕНиМ УрФУ, младший научный сотрудник ИММ УрО РАН",
      },
      {
        date: "2025-01-30",
        startTime: "17:50",
        endTime: "18:10",
        title: "Как стать гением, если ты маньяк?",
        speaker: "Бубб Полина Дмитриевна",
        image: "/schedule_2025/2025-01-30/3.png",
        speakerCredentials: "4 курс ФИИТ, красит кнопки и другие поверхности",
        description:
          "Жизнь не так гармонична, как может показаться, главное уметь использовать эту дисгармонию и непостоянство в свое благо",
      },
      {
        date: "2025-01-30",
        startTime: "18:10",
        endTime: "19:00",
        title: "ИИ в создании и визуализации танцев",
        speaker: "Боярских Арина Алексеевна",
        image: "/schedule_2025/2025-01-30/4.png",
        description:
          "Разберёмся, как ИИ понимает и генерирует хореографию, где это может быть применимо.",
        speakerCredentials:
          "Танцор и немного хореограф, немного увлекающийся ML",
      },
      {
        date: "2025-01-30",
        startTime: "19:00",
        endTime: "20:00",
        title: "Ужин",
      },
      {
        date: "2025-01-30",
        startTime: "20:00",
        endTime: "02:00",
        title: "Вечер шаблонного юмора",
      },
      {
        date: "2025-01-31",
        startTime: "02:00",
        endTime: "10:00",
        title: "Отбой",
      },
    ],
  },
  {
    date: "2025-01-31",
    events: [
      {
        date: "2025-01-31",
        startTime: "10:00",
        endTime: "11:00",
        title: "Завтрак",
      },
      {
        date: "2025-01-31",
        startTime: "11:00",
        endTime: "11:20",
        title:
          "Алгоритмическая торговля: просто о сложном. Краткий обзор и пример применения",
        speaker: "Агафонов Максим Сергеевич",
        image: "/schedule_2025/2025-01-31/1.jpg",
        speakerCredentials: "Студент 2 курса компьютерных наук",
        description:
          "Хотите узнать, как современные технологии позволяют автоматизировать торговые процессы и получать преимущество на финансовых рынках? Приходите на доклад.",
      },
      {
        date: "2025-01-31",
        startTime: "11:20",
        endTime: "11:50",
        title: "Тест Миллера — Рабина",
        speaker: "Овчинников Данила Сергеевич",
        image: "/schedule_2025/2025-01-31/2.jpg",
        speakerCredentials: "ФТ-203  (я обычный нормис из деревни)",
        description:
          "Слышали про простые числа? Мне кажется, вы не умеете в быстрое определение числа на простоту.",
      },
      {
        date: "2025-01-31",
        startTime: "11:50",
        endTime: "12:30",
        title:
          "Энигма и бомба Тьюринга — Уэлшмана, или Как математики выиграли войну",
        speaker: "Митяшин Тимофей Витальевич",
        description:
          "Расскажу про маленький деревянный ящик и про то, как его криптоанализ повлиял на мировую историю.",
      },
      {
        date: "2025-01-31",
        startTime: "12:30",
        endTime: "14:00",
        title: "Подготовка к биеннале",
      },
      {
        date: "2025-01-31",
        startTime: "14:00",
        endTime: "15:00",
        title: "Обед",
      },
      {
        date: "2025-01-31",
        startTime: "15:00",
        endTime: "17:00",
        title: "Экскурсии по биеннале",
      },
      {
        date: "2025-01-31",
        startTime: "17:00",
        endTime: "19:00",
        title: "Про Надёжность",
        speaker: "Зырянов Константин Александрович",
        image: "/schedule_2025/2025-01-31/3.jpeg",
        speakerCredentials: "я хз)",
        description:
          "Математическая лекция про мечты, старение, инверсию, ракеты и самосвалы, алкоголь, мобильные приложения, падших женщин, фашистов, какие-то схемы, выживание, первокурсников, Бэтмена, Богатство, канцелярские приборы, Дунаева и негров...",
      },
      {
        date: "2025-01-31",
        startTime: "19:00",
        endTime: "20:00",
        title: "Ужин",
      },
      {
        date: "2025-01-31",
        startTime: "20:00",
        endTime: "02:00",
        title: "Джазовая лекция",
        speaker: "Лехтик Владислав Анатольевич",
      },
      {
        date: "2025-02-01",
        startTime: "02:00",
        endTime: "10:00",
        title: "Отбой",
      },
    ],
  },
  {
    date: "2025-02-01",
    events: [
      {
        date: "2025-02-01",
        startTime: "10:00",
        endTime: "11:00",
        title: "Завтрак",
      },
      {
        date: "2025-02-01",
        startTime: "11:00",
        endTime: "11:50",
        title:
          "Математика и физика коллективных эффектов в ансамблях взаимодействующих магнитных наночастиц",
        speaker: "Иванов Алексей Олегович",
        image: "/schedule_2025/2025-02-01/1.jpeg",
        speakerCredentials:
          "Доктор физ.-мат. наук, профессор, зам. проректора по науке УрФУ",
        description:
          "На лекции поговорим о том, как применять знания из математического анализа, алгебры, дифференциальных уравнений для создания математических моделей, которые помогают понять, как ведут себя магнитные наночастицы. Рассмотрим, насколько интересным бывает использование наночастиц в современных технологиях и биомедицине. Также кратко обсудим теоретические результаты, успешно прогнозирующие свойства магнитных наносуспензий.",
      },
      {
        date: "2025-02-01",
        startTime: "11:50",
        endTime: "12:10",
        title: "Дилемма (?) заключённого",
        speaker: "Кишун Кирилл",
        speakerCredentials:
          "Бакалавр МОАИС, fullstack-разработчик в компании Кнопка",
        description: "Небольшое погружение в теорию игр.",
      },
      {
        date: "2025-02-01",
        startTime: "12:10",
        endTime: "12:30",
        title: "Открытые API по-русски",
        speaker: "Черных Сергей Николаевич",
        image: "/schedule_2025/2025-02-01/2.jpg",
        speakerCredentials: "PM, PO, SM",
        description:
          "Расскажу, что такое открытые API, открытый банкинг и что по этому поводу думает ЦБ.",
      },
      {
        date: "2025-02-01",
        startTime: "12:30",
        endTime: "14:00",
        title: "Время для самореализации",
      },
      {
        date: "2025-02-01",
        startTime: "14:00",
        endTime: "15:00",
        title: "Обед",
      },
      {
        date: "2025-02-01",
        startTime: "15:00",
        endTime: "17:00",
        title: "Поход за ёлкой",
      },
      {
        date: "2025-02-01",
        startTime: "17:00",
        endTime: "17:20",
        title: "OSINT. Разведка, которую мы заслужили.",
        speaker: "Белоусова Анастасия Станиславовна",
        image: "/schedule_2025/2025-02-01/3.jpeg",
      },
      {
        date: "2025-02-01",
        startTime: "17:20",
        endTime: "17:50",
        title: "Каждый охотник желает знать, где в радуге розовый",
        speaker: "Кузнецов Алексей Сергеевич",
        image: "/schedule_2025/2025-02-01/4.jpg",
        speakerCredentials:
          "Работаю в Контуре, окончил физ. факультет Пермского университета",
        description: `Из доклада мы узнаем:
a) где в радуге розовый;
b) как фотоны проникают в наш мозг;
c) что от нас скрывают производители мониторов.`,
      },
      {
        date: "2025-02-01",
        startTime: "17:50",
        endTime: "19:00",
        title: "3D-печать — это круто!",
        speaker: "Плаксин Алексей Дмитриевич",
        image: "/schedule_2025/2025-02-01/5.jpeg",
        speakerCredentials:
          "Системный аналитик, 10 лет занимался робототехникой, умудрился съездить на международный финал. Большой фанат DIY",
        description:
          "Из доклада вы узнаете, как появились 3D-принтеры, как развивалась история и какая занимательная внутри математика. А ещё сможете пощупать!",
      },
      {
        date: "2025-02-01",
        startTime: "19:00",
        endTime: "20:00",
        title: "Ужин",
      },
      {
        date: "2025-02-01",
        startTime: "20:00",
        endTime: "00:00",
        title: "Подготовка к концерту",
      },
      {
        date: "2025-02-02",
        startTime: "00:00",
        endTime: "10:00",
        title: "Новогодний концерт",
      },
    ],
  },
  {
    date: "2025-02-02",
    events: [
      {
        date: "2025-02-02",
        startTime: "10:00",
        endTime: "11:00",
        title: "Завтрак",
      },
      {
        date: "2025-02-02",
        startTime: "11:00",
        endTime: "14:00",
        title: "Посленовогодний сон",
      },
      {
        date: "2025-02-02",
        startTime: "14:00",
        endTime: "15:00",
        title: "Обед",
      },
      {
        date: "2025-02-02",
        startTime: "15:00",
        endTime: "17:00",
        title: "Время для самореализации",
      },
      {
        date: "2025-02-02",
        startTime: "17:00",
        endTime: "17:50",
        title: "Как принимать решения, чтобы потом не принимать таблетки",
        speaker: "Лехтик Владислав Анатольевич",
        image: "/schedule_2025/2025-02-02/1.gif",
        description: `Проблема принятия хороших решений возникает перед нами непрерывно — от мелких бытовых задач до серьезных жизненных ситуаций. Иногда очень хочется отмотать время назад и исправить неразумный выбор.
Есть более надёжный метод — теория принятия решений. Сегодня эта наука хорошо работает в крупном бизнесе и финансах, где цена ошибки высока. Ряд несложных подходов помогают снизить риск неудач. Лекция про то, как эти ценные навыки помогают не только в бизнесе, но и в личной жизни.`,
      },
      {
        date: "2025-02-02",
        startTime: "17:50",
        endTime: "19:00",
        title:
          "Математическая теория переговоров: как малой кровью поделить пирог",
        speaker: "Тарасова Елизавета Юрьевна",
        image: "/schedule_2025/2025-02-02/2.jpg",
        speakerCredentials:
          "Аспирант матмеха СПбГУ, преподаватель ФТИИ ИТМО, руководитель научного офиса Центра ИИ и Науки о Данных СПбГУ",
        description:
          "Почему переговоры — это как делить конфеты с младшим братом, но сложнее? Почему справедливость для одного — это несправедливость для другого? И как математика помогает искать ответы на эти вопросы? На этой лекции мы погрузимся в математическую теорию переговоров, где справедливость — это не просто слово, а чёткие модели и принципы. Обсудим простые и увлекательные подходы, которые помогут взглянуть на споры с неожиданной стороны.",
      },
      {
        date: "2025-02-02",
        startTime: "19:00",
        endTime: "20:00",
        title: "Ужин",
      },
      {
        date: "2025-02-02",
        startTime: "20:00",
        endTime: "02:00",
        title: "Гоп-доп",
      },
      {
        date: "2025-02-03",
        startTime: "02:00",
        endTime: "10:00",
        title: "Отбой",
      },
    ],
  },
  {
    date: "2025-02-03",
    events: [
      {
        date: "2025-02-03",
        startTime: "10:00",
        endTime: "11:00",
        title: "Завтрак",
      },
      {
        date: "2025-02-03",
        startTime: "11:00",
        endTime: "11:50",
        title: "На чём учатся LLM и как в этом помогает математика?",
        speaker: "Гейн Павел Александрович",
        image: "/schedule_2025/2025-02-03/1.png",
        speakerCredentials:
          "Доцент кафедры алгебры и фундаментальной информатики, разработчик в Т-Банке",
        description:
          "На лекции мы поговорим о том, как устроен процесс обучения больших языков моделей, какие данные для этого необходимы. Также мы разберем, какие математические методы и алгоритмы используются, чтобы полученные модели были наилучшего качества.",
      },
      {
        date: "2025-02-03",
        startTime: "11:50",
        endTime: "12:10",
        title: "Как охранять музей?",
        speaker: "Евпланова Алёна Сергеевна",
        image: "/schedule_2025/2025-02-03/2.jpg",
        speakerCredentials:
          "Мамина радость, папина гордость и просто хороший человек",
        description:
          "Представим себя на день охранниками из музея. Что нужно, чтобы наши шедевры не украли?",
      },
      {
        date: "2025-02-03",
        startTime: "12:10",
        endTime: "12:30",
        title: "Планеры",
        speaker: "Климентов Андрей Дмитриевич",
        speakerCredentials: "Математик-механик. 14 лет в авиамодельном спорте",
        description:
          "Из доклада мы узнаем, как сконструировать планер, поймём как он работает и какая математика и механика за ним стоит!",
      },
      {
        date: "2025-02-03",
        startTime: "12:30",
        endTime: "14:00",
        title: "Время для самореализации и запуска планеров",
      },
      {
        date: "2025-02-03",
        startTime: "14:00",
        endTime: "15:00",
        title: "Обед",
      },
      {
        date: "2025-02-03",
        startTime: "15:00",
        endTime: "17:00",
        title: "Квиз",
        speaker: "Контур",
      },
      {
        date: "2025-02-03",
        startTime: "17:00",
        endTime: "17:50",
        title: "Под капотом Stable Diffusion",
        speaker: "Михайлов Игорь Олегович",
        image: "/schedule_2025/2025-02-03/3.jpg",
        speakerCredentials:
          "Преподаватель УрФУ, мл. научный сотрудник ИММ УрО РАН, prompt-инженер, нейрохудожник",
        description:
          "Каждый из вас видел нейрокартинки, а многие, вероятно, создавали их с помощью различных сервисов. Но задумывались ли вы, как нейросети создают изображения? На этой лекции вы узнаете, как работают нейросети, как с их помощью классифицируют изображения и, наконец, как искусственный интеллект создаёт изображение по текстовому запросу.",
      },
      {
        date: "2025-02-03",
        startTime: "17:50",
        endTime: "19:00",
        title: "Сто слоёв интернет-хоррора",
        speaker: "Созник Никита Михайлович",
        image: "/schedule_2025/2025-02-03/4.jpg",
        speakerCredentials:
          "Android-разработчик из Контура. Любитель мармелада",
        description:
          "Из доклада мы узнаем, что такое интернет-хоррор, разберёмся, почему это отдельный жанр, посмотрим на его направления.",
      },
      {
        date: "2025-02-03",
        startTime: "19:00",
        endTime: "20:00",
        title: "Ужин",
      },
      {
        date: "2025-02-03",
        startTime: "20:00",
        endTime: "02:00",
        title: "Вечер смешных шуток",
      },
      {
        date: "2025-02-04",
        startTime: "02:00",
        endTime: "10:00",
        title: "Отбой",
      },
    ],
  },
  {
    date: "2025-02-04",
    events: [
      {
        date: "2025-02-04",
        startTime: "10:00",
        endTime: "11:00",
        title: "Завтрак",
      },
      {
        date: "2025-02-04",
        startTime: "11:00",
        endTime: "11:50",
        title: "RAG и манипуляции над векторным пространством",
        speaker: "Ходненко Иван Владимирович",
        speakerCredentials:
          "Кандидат тех. наук, ст. научный сотрудник ИТМО, ст. преподаватель факультета технологий ИИ",
        description: `Большая языковая модель (БЯМ или LLM) — это математическая модель, способная генерировать текст (ответ) на основе переданного текста (запроса).
Но что, если у вас есть специфическая информация, например, флуд-чат ЗМШ, и вы хотите, чтобы LLM нашла и выдала ответ на вопрос: «Кто чаще всего отправлял смешные мемы?». В таком случае можно обработать этот чат, преобразовать его в подходящий формат и передать в модель как контекст.
А что делать, если флуд-сообщений слишком много? Здесь на помощь приходит подход RAG (retrieval-augmented generation), который позволяет искать нужную информацию в большом объёме данных и передавать модели только релевантные фрагменты.
Как именно это работает и какое место в этом процессе занимают векторные представления — обсудим на лекции.`,
      },
      {
        date: "2025-02-04",
        startTime: "11:50",
        endTime: "12:30",
        title: "Матмодель UUID в задаче идентификации",
        speaker: "Бородин Андрей",
        image: "/schedule_2025/2025-02-04/1.jpg",
        speakerCredentials:
          "Инженер, кандидат тех. наук, руководитель разработки СУБД с открытым исходным кодом в Яндексе. Преподаватель ШАДе и УрФУ",
        description:
          "Отличить тёплое от мягкого — вполне математическая проблема, решение которой помогает создавать полезные системы. На лекции я расскажу о UUID (universally unique identifier) и о математических, философских и инженерных вопросах, возникавших при проектировании этой технологии.",
      },
      {
        date: "2025-02-04",
        startTime: "12:30",
        endTime: "14:00",
        title: "Соревнования по решению математических задачек",
        description: "ИТ-Элемент29",
      },
      {
        date: "2025-02-04",
        startTime: "14:00",
        endTime: "15:00",
        title: "Обед",
      },
      {
        date: "2025-02-04",
        startTime: "15:00",
        endTime: "18:00",
        title: "Приведение корпусов в первоначальный вид",
      },
      {
        date: "2025-02-04",
        startTime: "18:00",
        endTime: "19:00",
        title: "Закрытие",
      },
      {
        date: "2025-02-04",
        startTime: "19:00",
        endTime: "20:00",
        title: "Ужин",
      },
      {
        date: "2025-02-04",
        startTime: "20:00",
        endTime: "10:00",
        title: "Вечер несмешных шуток",
      },
    ],
  },
  {
    date: "2025-02-05",
    events: [
      {
        date: "2025-02-05",
        startTime: "10:00",
        endTime: "11:00",
        title: "Завтрак",
      },
      {
        date: "2025-02-05",
        startTime: "11:00",
        endTime: "13:00",
        title: "Автобусы",
      },
    ],
  },
];
